; domain
(define (domain shakey-c)
  (:requirements :strips)
  (:predicates
   (at ?what ?square)
   (adj ?square-1 ?square-2)
   (have ?who ?what)
   (is-agent ?who)
   (is-gold ?what)
   (is-box ?what)
   (is-turned-on ?switch ?where)
   (is-in-room ?what ?where)
   (is-notOn-switch1 ?what)
   (is-notOn-switch2 ?what)
   (is-notOn-switch3 ?what)
   (switch1 ?where)
   (switch2 ?where)
   (switch3 ?where))

; turns on the switch in a given room
  (:action switch 
    	:parameters (?who ?where ?what ?switch-on)
    	:precondition (and (is-agent ?who)
		       	(at ?who ?where)
			(not(is-turned-on ?switch-on ?where)) ; check if the light is on or not
			(at ?switch-on ?where) ;check if the switch is in the same room as agent
			(have ?who ?what)) ;check if the agent has the box
    	:effect  (and (is-turned-on ?switch-on ?where)) ;return switch turned on in a given room
)

;takes the box in a given room
  (:action take-box
	:parameters (?who ?what ?where)
    	:precondition (and (is-agent ?who)
			(is-box ?what)
		       	(at ?who ?where) 
			(at ?what ?where) ;check if the box is in the same room as the agent
		       	(not (have ?who ?what))) ;check if the agent has the box
    	:effect	(and (not (at ?what ?where)) ; return agent has the box as well as the box is no longer in the room
			(have ?who ?what)
	)
)

;use a wide door
  (:action use-door-wide
	:parameters (?who ?where ?to)
	:precondition (and (is-agent ?who)
			 (adj ?where ?to) ;check if this move is possible
			)
	:effect		(and (not(at ?who ?where)) ;return agent not in the previous position and in the new one
				(at ?who ?to)
	)
)

;take gold in a give room
  (:action take-gold
	:parameters (?who ?where ?what ?switch)
	:precondition (and (is-agent ?who)
			 (is-gold ?what) ; check if ?what is the gold
			 (at ?who ?where)
			 (at ?what ?where) ;check if the agent is in the same room as the agent
			 (is-turned-on ?switch ?where)) ;check if the switch is turned on
	:effect		(and (not(at ?what ?where)) (have ?who ?what)) ; return agent has the gold and the gold is not in the room
)
			

)

; problem
(define (problem shakey-c-1)
  (:domain shakey-c)
  (:objects sq-1-1 sq-1-2 sq-1-3
	    the-gold the-box
	    agent switch switch2 switch3 room1 room2 room3)
  (:init (adj sq-1-1 sq-1-2) (adj sq-1-2 sq-1-1)
	 (adj sq-1-2 sq-1-3) (adj sq-1-3 sq-1-2)
	 (is-gold the-gold)
	 (at the-gold sq-1-3)
	 (is-box the-box)
	 (at the-box sq-1-1)
	 (is-agent agent)
	 (not(have agent the-box))
	 (at agent sq-1-2)
	 (is-notOn-switch1 switch)
	 (not(is-turned-on switch sq-1-1))
	 (not(is-turned-on switch sq-1-2))
	 (not(is-turned-on switch sq-1-3))
	
)
  (:goal (and (have agent the-gold) ))
  )

; plan
1. (use-door-wide agent sq-1-2 sq-1-1)
   deleted: (at agent sq-1-2)
   added: (at agent sq-1-1)
   goals met: 0 of 1
2. (use-door-wide agent sq-1-2 sq-1-3)
   added: (at agent sq-1-3)
   goals met: 0 of 1
3. (take-box agent the-box sq-1-1)
   deleted: (at the-box sq-1-1)
   added: (have agent the-box)
   goals met: 0 of 1
4. (switch agent sq-1-3 the-box the-gold)
   added: (is-turned-on the-gold sq-1-3)
   goals met: 0 of 1
5. (take-gold agent sq-1-3 the-gold the-gold)
   deleted: (at the-gold sq-1-3)
   added: (have agent the-gold)
   goals met: 1 of 1
